Revit 2027 API
EnergyDataSettings.PercentageSkylights Property
 Used for the conceptual energy model (AnalysisType is ConceptualMassesAndBuildingElements). The approximate percentage of the building roof surfaces for masses.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double PercentageSkylights { get; set; }
Public Property PercentageSkylights As Double
	Get
	Set
public:
property double PercentageSkylights {
	double get ();
	void set (double value);
}
member PercentageSkylights : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The percentage skylights value is between 0.00 and 0.95.
Remarks
 This value is used to automatically model the skylights in massing instances when the Energy Analytical model is being created.
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace